Documents/РезультатыСпецоценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РезультатыСпецоценкиУсловийТруда</Name>
			<BasedOn>
				<xr:Item>Document.ПодготовкаСпецоценкиУсловийТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.РезультатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.УдалитьРезультатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.УдалитьПлановыеДатыСпециальнойОценкиУсловийТруда</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаСпецоценкиУсловийТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезультатов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредставлениеРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассУсловийТруда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рекомендации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналогичныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАналогичноеМесто</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналогичноеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РолиЧленовКомиссииОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РолиЧленовКомиссииОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КлассыУсловийТрудаПоРезультатамСпециальнойОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КлассыУсловийТрудаПоРезультатамСпециальнойОценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Допустимый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптимальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РезультатыСпецоценкиУсловийТруда/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПриСозданииНаСервере(ЭтотОбъект, Документы.РезультатыСпецоценкиУсловийТруда.ОписаниеПодписейДокумента());
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// Создается новый документ.
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный", "Объект.Организация", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		ЗаполнитьДанныеФормыПоОрганизации();
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_РезультатыСпецоценкиУсловийТруда", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПослеЗаписиНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	ПриПолученииДанныхНаСервере();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыАналогичныхРабочихМест());
	ТекущийОбъект.ЗаполнитьВредныеФакторы(ИдентификаторыВредныхФакторов());
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыАналогичныхРабочихМест());
	ТекущийОбъект.ЗаполнитьВредныеФакторы(ИдентификаторыВредныхФакторов());
	Если НЕ ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Объект");
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьДанныеФормыПоОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ДокументОснованиеПриИзмененииЗавершение", ЭтотОбъект);
	ЗарплатаКадрыРасширенныйКлиент.ПроверитьВозможностьОчисткиТабличныхЧастей(ЭтаФорма, "РабочиеМеста", Оповещение);
	
КонецПроцедуры

#Область ОбработчикиПодсистемыПодписиДокументов

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент)
	ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент)
	ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.РабочиеМестаКомандаАналогичныеМеста Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуАналогичныхРабочихМестПоСтроке(ТекущиеДанные, Истина);
	ИначеЕсли Поле = Элементы.РабочиеМестаКомандаВредныеФакторы Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВредныхФакторовРабочихМестПоСтроке(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РабочиеМестаОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаРабочееМестоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМестаРабочееМестоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомиссия

&НаКлиенте
Процедура КомиссияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.РольВКомиссии = ПредопределенноеЗначение("Перечисление.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияЧленКомиссииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комиссия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЧленКомиссии) Тогда
		ТекущиеДанные.Должность = ДолжностьЧленаКомиссии(ТекущиеДанные.ЧленКомиссии);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьАналогичныеРабочиеМеста(Команда)
	
	ОчиститьСообщения();	
	
	ОсновноеРабочееМесто = Неопределено;
	
	ВыделенныеСтроки = Элементы.РабочиеМеста.ВыделенныеСтроки;
	
	МассивАналогичныеМеста = Новый Массив;
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		СтрокаТаблицы = Объект.РабочиеМеста.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
		ОткрытьФормуАналогичныхРабочихМестПоСтроке(СтрокаТаблицы);
		Возврат;
	Иначе
		СоответствиеПодразделений = Новый Соответствие;
		СоответствиеДолжностей = Новый Соответствие;
		
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.РабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если СтрокаТаблицы <> Неопределено Тогда 
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.РабочееМесто) Тогда
					Продолжить;
				КонецЕсли;
				МассивАналогичныеМеста.Добавить(СтрокаТаблицы.РабочееМесто);
				Для Каждого РабочееМесто Из СтрокаТаблицы.МассивАналогичныхРабочихМест Цикл
					Если ОсновноеРабочееМесто = Неопределено Тогда
						ОсновноеРабочееМесто = СтрокаТаблицы.РабочееМесто;
					КонецЕсли;
					МассивАналогичныеМеста.Добавить(РабочееМесто);
				КонецЦикла;
				СоответствиеПодразделений.Вставить(СтрокаТаблицы.Подразделение,"");
				СоответствиеДолжностей.Вставить(СтрокаТаблицы.Должность,"");
			КонецЕсли;
		КонецЦикла;
		Если СоответствиеПодразделений.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: выберите строки с одинаковыми подразделениями.'");
		ИначеЕсли СоответствиеДолжностей.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: выберите строки с одинаковыми должностями.'");
		КонецЕсли;
	КонецЕсли;
	
	МассивРабочиеМеста = Новый Массив;
	ПараметрыОтбора = Новый Структура("Должность, Подразделение", СтрокаТаблицы.Должность, СтрокаТаблицы.Подразделение);
	Для Каждого СтрокаРабочиеМеста Из Объект.РабочиеМеста.НайтиСтроки(ПараметрыОтбора) Цикл
		Если Не ЗначениеЗаполнено(СтрокаРабочиеМеста.РабочееМесто) Тогда
			Продолжить;
		КонецЕсли;
		МассивРабочиеМеста.Добавить(Новый Структура("РабочееМесто", СтрокаРабочиеМеста.РабочееМесто));
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	Если МассивАналогичныеМеста.Количество() > 0 Тогда
		ПараметрыОткрытия.Вставить("ОсновноеРабочееМесто", ?(ОсновноеРабочееМесто = Неопределено, МассивАналогичныеМеста[0], ОсновноеРабочееМесто));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("АналогичныеМеста", ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивАналогичныеМеста));
	ПараметрыОткрытия.Вставить("РабочиеМеста", МассивРабочиеМеста);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыделитьАналогичныеРабочиеМестаПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.Форма.ФормаАналогичныхМест",
		ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьАналогичныеРабочиеМестаПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВыделитьАналогичныеРабочиеМестаПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьАналогичныеРабочиеМестаПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	
	ОсновноеРабочееМесто = РезультатЗакрытия.ОсновноеРабочееМесто;
	ПрежнееРабочееМесто = РезультатЗакрытия.ПрежнееРабочееМесто;
	ЕстьАналогичныеМеста = РезультатЗакрытия.АналогичныеМеста.Количество() > 0;
	
	Если ПрежнееРабочееМесто <> ОсновноеРабочееМесто И ЕстьАналогичныеМеста Тогда
		// Очистим аналогичные рабочие места у прежнего основного рабочего места
		НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ПрежнееРабочееМесто));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.РабочиеМеста.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	НайденныеСтрокиОсновногоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ОсновноеРабочееМесто));
	Если НайденныеСтрокиОсновногоМеста.Количество() = 0 Тогда
		// Заменим предыдущее основное рабочее место текущим
		НайденныеСтрокиОсновногоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ПрежнееРабочееМесто));
	КонецЕсли;
	
	Если ЕстьАналогичныеМеста Тогда
		Если НайденныеСтрокиОсновногоМеста.Количество() = 0 Тогда
			ОсновнаяСтрока = Объект.РабочиеМеста.Добавить();
			ОсновнаяСтрока.РабочееМесто = ОсновноеРабочееМесто;
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			ОсновнаяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			ОсновнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, ОсновнаяСтрока);
		Иначе
			Для Каждого ОсновнаяСтрока Из НайденныеСтрокиОсновногоМеста Цикл
				ОсновнаяСтрока.РабочееМесто = ОсновноеРабочееМесто;
				РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, ОсновнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		
		МассивАналогичныхРабочихМестПриемник = Новый Массив(ОсновнаяСтрока.МассивАналогичныхРабочихМест);
		
		Для Каждого АналогичноеРабочееМесто Из РезультатЗакрытия.АналогичныеМеста Цикл
			// Если аналогичное место было основным, то его нужно заменить на основное рабочее место.
			НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", АналогичноеРабочееМесто));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект.РабочиеМеста.Удалить(НайденнаяСтрока);
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				МассивАналогичныхРабочихМестПриемник,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(АналогичноеРабочееМесто),
				Истина);
		КонецЦикла;
		
		ОсновнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхРабочихМестПриемник);
		ЗаполнитьКраткийСоставАналогичныхМест(ОсновнаяСтрока);
	Иначе
		Для Каждого НайденнаяСтрока Из НайденныеСтрокиОсновногоМеста Цикл
			НайденнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			ЗаполнитьКраткийСоставАналогичныхМест(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого РабочееМесто Из РезультатЗакрытия.РабочиеМеста Цикл
		// Если нет рабочего места, значит оно было удалено из аналогичных рабочих мест
		// Такое рабочее место нужно вернуть в список рабочих мест.
		НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", РабочееМесто));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.РабочиеМеста.Добавить();
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			НоваяСтрока.РабочееМесто = РабочееМесто;
			РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, НоваяСтрока);
			
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВредныеФакторыПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВредныеФакторыПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВредныеФакторыПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	
	РабочееМесто = РезультатЗакрытия.РабочееМесто;
	ВредныеФакторы = РезультатЗакрытия.ВредныеФакторы;
	
	НайденныеСтрокиРабочегоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", РабочееМесто));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтрокиРабочегоМеста Цикл
		НайденнаяСтрока.МассивВредныхФакторов = Новый ФиксированныйМассив(ВредныеФакторы);
		ЗаполнитьКраткийСоставВредныхФакторов(НайденнаяСтрока);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлассУсловийТрудаДляВсехРабочихМест(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьКлассУсловийТрудаПослеВыбораЗначения", ЭтотОбъект, Новый Структура("ВидЗаполнения", "ВсеРабочиеМеста"));
	ОткрытьФорму(
		"ОбщаяФорма.ФормаВыбораКлассаУсловийТрудаПоРезультатамСпециальнойОценки",
		Новый Структура("ТекущаяСтрока", ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый")),
		ЭтотОбъект, , , ,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлассУсловийТрудаДляВыделенныхРабочихМест(Команда)
	
	Оповещение = Новый ОписаниеОповещения(
		"ЗаполнитьКлассУсловийТрудаПослеВыбораЗначения",
		ЭтотОбъект,
		Новый Структура("ВидЗаполнения, ВыделенныеСтроки", "ВыделенныеРабочиеМеста", Элементы.РабочиеМеста.ВыделенныеСтроки));
	ОткрытьФорму(
		"ОбщаяФорма.ФормаВыбораКлассаУсловийТрудаПоРезультатамСпециальнойОценки",
		Новый Структура("ТекущаяСтрока", ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый")),
		ЭтотОбъект, , , ,
		Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлассУсловийТрудаПослеВыбораЗначения(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Или ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ВидЗаполнения = "ВсеРабочиеМеста" Тогда
		Для каждого СтрокаРабочиеМеста Из Объект.РабочиеМеста Цикл
			СтрокаРабочиеМеста.КлассУсловийТруда = Значение;
		КонецЦикла;
	Иначе
		Для каждого ВыделеннаяСтрока Из ДополнительныеПараметры.ВыделенныеСтроки Цикл
			НайденнаяСтрока = Объект.РабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока.КлассУсловийТруда = Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлассУсловийТрудаПоПредыдущейОценке(Команда)
	ЗаполнитьКлассУсловийТрудаПоПредыдущейОценкеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПараметрыОтбора.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхРабочихМест());
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаВыбора", ПараметрыФормы, Элементы.РабочиеМеста);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Функция ИдентификаторыАналогичныхРабочихМест()
	
	ИдентификаторыАналогичныхРабочихМест = Новый Соответствие;
	
	Для Каждого РабочееМесто Из Объект.РабочиеМеста Цикл
		ИдентификаторыАналогичныхРабочихМест.Вставить(РабочееМесто.ИдентификаторСтрокиРабочегоМеста, РабочееМесто.МассивАналогичныхРабочихМест);
	КонецЦикла;
	
	Возврат ИдентификаторыАналогичныхРабочихМест;
	
КонецФункции

&НаСервере
Функция ИдентификаторыВредныхФакторов()
	
	ИдентификаторыВредныхФакторов = Новый Соответствие;
	
	Для Каждого РабочееМесто Из Объект.РабочиеМеста Цикл
		ИдентификаторыВредныхФакторов.Вставить(РабочееМесто.ИдентификаторСтрокиРабочегоМеста, РабочееМесто.МассивВредныхФакторов);
	КонецЦикла;
	
	Возврат ИдентификаторыВредныхФакторов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивАналогичныхМест(СтрокаРабочегоМеста)
	
	Если СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Неопределено Тогда
		МассивАналогичныеМеста = Новый Массив();
	Иначе
		МассивАналогичныеМеста = Новый Массив(СтрокаРабочегоМеста.МассивАналогичныхРабочихМест);
	КонецЕсли;
	// Добавим текущее рабочее место в аналогичные места
	МассивАналогичныеМеста.Добавить(СтрокаРабочегоМеста.РабочееМесто);
	
	Возврат МассивАналогичныеМеста;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста)
	
	АналогичныеМеста = МассивАналогичныхМест(СтрокаРабочегоМеста);
	Если АналогичныеМеста.Количество() = 1 Тогда
		СтрокаРабочегоМеста.КомандаАналогичныеМеста = "";
		Возврат;
	КонецЕсли;
	
	МаксимальнаяДлинаСтроки = 100;
	КраткийСостав = "";
	Для Каждого ЭлементМассива Из АналогичныеМеста Цикл
		Если Не ПустаяСтрока(КраткийСостав) Тогда
			КраткийСостав = КраткийСостав + ", ";
		КонецЕсли;
		КраткийСостав = КраткийСостав + Строка(ЭлементМассива);
		Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
		КраткийСостав = Лев(КраткийСостав, МаксимальнаяДлинаСтроки - 3) + "...";
	КонецЕсли;
	СтрокаРабочегоМеста.КомандаАналогичныеМеста = КраткийСостав;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивВредныхФакторов(СтрокаВредныхФакторов)
	
	Если СтрокаВредныхФакторов.МассивВредныхФакторов = Неопределено Тогда
		Возврат Новый Массив();
	Иначе
		Возврат Новый Массив(СтрокаВредныхФакторов.МассивВредныхФакторов);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКраткийСоставВредныхФакторов(СтрокаВредныхФакторов)
	
	ВредныеФакторы = МассивВредныхФакторов(СтрокаВредныхФакторов);
	Если ВредныеФакторы.Количество() = 0 Тогда
		СтрокаВредныхФакторов.КомандаВредныеФакторы = "";
		Возврат;
	КонецЕсли;
	
	МаксимальнаяДлинаСтроки = 100;
	КраткийСостав = "";
	КоличествоПсихиатрических = 0;
	Для Каждого ЭлементМассива Из ВредныеФакторы Цикл
		КодФактора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементМассива, "Код");
		Если ПустаяСтрока(КодФактора) Тогда
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементМассива, "ВидОсмотра") = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
				КоличествоПсихиатрических = КоличествоПсихиатрических + 1;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если Не ПустаяСтрока(КраткийСостав) Тогда
			КраткийСостав = КраткийСостав + ", ";
		КонецЕсли;
		КраткийСостав = КраткийСостав + КодФактора;
		Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоПсихиатрических > 0 И ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования") Тогда
		ТекстПсихФакторов = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 псих. фактор;;%1 псих. фактора;%1 псих. факторов;'"), КоличествоПсихиатрических);
		ТекстСоединителя = Символы.НПП + НСтр("ru = 'и еще'") + Символы.НПП;
		ТекстПсихФакторов = ?(ПустаяСтрока(КраткийСостав), ТекстПсихФакторов, ТекстСоединителя + ТекстПсихФакторов);
		КраткийСостав = КраткийСостав + ТекстПсихФакторов;
	КонецЕсли;
	Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
		КраткийСостав = Лев(КраткийСостав, МаксимальнаяДлинаСтроки - 3) + "...";
	КонецЕсли;
	СтрокаВредныхФакторов.КомандаВредныеФакторы = КраткийСостав;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьДанныеФормыПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоОрганизации()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	Если Объект.Комиссия.Количество() = 0 И (ЗначениеЗаполнено(Объект.Руководитель) Или ЗначениеЗаполнено(Объект.ОтветственныйЗаОхрануТруда)) Тогда
		Если ЗначениеЗаполнено(Объект.Руководитель) Тогда
			НоваяСтрокаКомиссии = Объект.Комиссия.Добавить();
			НоваяСтрокаКомиссии.ЧленКомиссии = Объект.Руководитель;
			НоваяСтрокаКомиссии.Должность = Объект.ДолжностьРуководителя;
			НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОтветственныйЗаОхрануТруда) Тогда
			НоваяСтрокаКомиссии = Объект.Комиссия.Добавить();
			НоваяСтрокаКомиссии.ЧленКомиссии = Объект.ОтветственныйЗаОхрануТруда;
			НоваяСтрокаКомиссии.Должность = Объект.ДолжностьОтветственногоЗаОхрануТруда;
			НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.Заполнить(Объект.ДокументОснование);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Иначе
		ЗаполнитьПереченьРабочихМест();
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	МаксимальныйИдентификаторСтрокиРабочегоМеста = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.РабочиеМеста, "ИдентификаторСтрокиРабочегоМеста");
	
	Для Каждого СтрокаРабочегоМеста Из Объект.РабочиеМеста Цикл
		ЗаполнитьМассивАналогичныхРабочихМест(СтрокаРабочегоМеста);
		ЗаполнитьМассивВредныхФакторовРабочегоМеста(СтрокаРабочегоМеста);
	КонецЦикла;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПереченьРабочихМест()
	
	РезультатыЗапроса = ОхранаТруда.ДанныеПоРабочимМестам(
		Объект.Организация, Объект.ДатаНачала, Объект.ДатаРезультатов, Объект.Подразделение);
	
	Объект.РабочиеМеста.Очистить();
	Объект.АналогичныеМеста.Очистить();
	Объект.ВредныеФакторы.Очистить();
	МаксимальныйИдентификаторСтрокиРабочегоМеста = 0;
	
	ЕстьМодульМедицинскиеОсмотры = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда	
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		ЕстьМодульМедицинскиеОсмотры = Истина;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница() - 1).Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
		НоваяСтрока = Объект.РабочиеМеста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
		МассивАналогичныхМестПриемник = Новый Массив();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.АналогичноеМесто) Тогда
				МассивАналогичныхМестПриемник.Добавить(Выборка.АналогичноеМесто);
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхМестПриемник);
		ЗаполнитьКраткийСоставАналогичныхМест(НоваяСтрока);
		МассивВредныхФакторов = Новый Массив;
		Если ЕстьМодульМедицинскиеОсмотры Тогда	
			МассивВредныхФакторов = МодульМедицинскиеОсмотры.ВредныеФакторыИВидыРаботРабочегоМеста(НоваяСтрока.РабочееМесто);
		КонецЕсли;
		НоваяСтрока.МассивВредныхФакторов = Новый ФиксированныйМассив(МассивВредныхФакторов);
		ЗаполнитьКраткийСоставВредныхФакторов(НоваяСтрока);
	КонецЦикла;
	
	Объект.Комиссия.Загрузить(РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница()-2).Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивАналогичныхРабочихМест(СтрокаРабочегоМеста)
	
	МассивАналогичныхМестПриемник = Новый Массив;
	
	НайденныеСтроки = Объект.АналогичныеМеста.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		МассивАналогичныхМестПриемник.Добавить(НайденнаяСтрока.АналогичноеМесто);
	КонецЦикла;
	
	СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхМестПриемник);
	ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивВредныхФакторовРабочегоМеста(СтрокаРабочегоМеста)
	
	МассивВредныхФакторовПриемник = Новый Массив;
	
	НайденныеСтроки = Объект.ВредныеФакторы.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		МассивВредныхФакторовПриемник.Добавить(НайденнаяСтрока.ВредныйФактор);
	КонецЦикла;
	
	СтрокаРабочегоМеста.МассивВредныхФакторов = Новый ФиксированныйМассив(МассивВредныхФакторовПриемник);
	ЗаполнитьКраткийСоставВредныхФакторов(СтрокаРабочегоМеста)
	
КонецПроцедуры

&НаСервере
Процедура РабочиеМестаРабочееМестоПриИзмененииНаСервере(ИдентификаторСтроки, Знач ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Объект.РабочиеМеста.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		ТекущаяСтрока.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.РабочееМесто, "Подразделение");
		ТекущаяСтрока.Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.РабочееМесто, "Должность");
	КонецЕсли;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("РабочееМесто", ТекущаяСтрока.РабочееМесто);
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыСпециальнойОценкиУсловийТруда.Период,
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто,
	|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаДокумента, РабочееМесто = &РабочееМесто) КАК РезультатыСпециальнойОценкиУсловийТруда";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока.КлассУсловийТруда = Выборка.КлассУсловийТруда;
	КонецЦикла;
	
	ЗаполнитьКраткийСоставАналогичныхМест(ТекущаяСтрока);
	
	МассивВредныхФакторов = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда	
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МассивВредныхФакторов = МодульМедицинскиеОсмотры.ВредныеФакторыИВидыРаботРабочегоМеста(ТекущаяСтрока.РабочееМесто);
	КонецЕсли;
	ТекущаяСтрока.МассивВредныхФакторов = Новый ФиксированныйМассив(МассивВредныхФакторов);
	ЗаполнитьКраткийСоставВредныхФакторов(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Исполнитель", "Доступность", Не ЗначениеЗаполнено(Объект.ДокументОснование));
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзмененииЗавершение(Отказ,ДополнительныеПараметры) Экспорт
	
	Если Не Отказ Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлассУсловийТрудаПоПредыдущейОценкеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", Объект.РабочиеМеста.Выгрузить().ВыгрузитьКолонку("РабочееМесто"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаРезультатов", Объект.ДатаРезультатов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто,
	|	РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(
	|			&ДатаРезультатов,
	|			РабочееМесто В (&РабочиеМеста)
	|				И Регистратор <> &Ссылка) КАК РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", Выборка.РабочееМесто));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Выборка,, "РабочееМесто");
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДолжностьЧленаКомиссии(ЧленКомиссии)
	
	ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ЧленКомиссии, Истина, Объект.Организация, Объект.ДатаНачала);
	Сотрудники = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, "ТекущаяДолжность", Объект.ДатаНачала);
	
	Если КадровыеДанные.Количество() > 0 Тогда
		ТекущаяДолжность = КадровыеДанные[0].ТекущаяДолжность;
		Если ЗначениеЗаполнено(ТекущаяДолжность) Тогда
			Возврат ТекущаяДолжность;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАналогичныхРабочихМестПоСтроке(ТекущиеДанные, ЭтоКомандаВыделение = Ложь)
	
	МассивАналогичныеМеста = Новый Массив();
	
	Если Не ТекущиеДанные.МассивАналогичныхРабочихМест = Неопределено Тогда
		Для Каждого РабочееМесто Из ТекущиеДанные.МассивАналогичныхРабочихМест Цикл
			МассивАналогичныеМеста.Добавить(РабочееМесто);
		КонецЦикла;
	КонецЕсли;
	
	МассивРабочиеМеста = Новый Массив;
	Описание = ОписаниеРабочегоМеста();
	ЗаполнитьЗначенияСвойств(Описание, ТекущиеДанные);
	Для Каждого СтрокаРабочиеМеста Из Объект.РабочиеМеста.НайтиСтроки(Описание) Цикл
		Если СтрокаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ТекущиеДанные.ИдентификаторСтрокиРабочегоМеста Тогда
			// Текущую строку не добавляем в доступные рабочие места
			Продолжить;
		КонецЕсли;
		МассивРабочиеМеста.Добавить(Новый Структура("РабочееМесто", СтрокаРабочиеМеста.РабочееМесто));
	КонецЦикла;
	
	Если МассивАналогичныеМеста.Количество() = 0 И МассивРабочиеМеста.Количество() = 0 Тогда
		Если Не ЭтоКомандаВыделение Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: в табличной части нет рабочих мест с такими же подразделением и должностью.'");
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АналогичныеМеста", МассивАналогичныеМеста);
	ПараметрыОткрытия.Вставить("РабочиеМеста", МассивРабочиеМеста);
	ПараметрыОткрытия.Вставить("ОсновноеРабочееМесто", ТекущиеДанные.РабочееМесто);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыделитьАналогичныеРабочиеМестаПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.Форма.ФормаАналогичныхМест",
		ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВредныхФакторовРабочихМестПоСтроке(ТекущиеДанные)
	
	МассивВредныеФакторы = Новый Массив();
	
	Если Не ТекущиеДанные.МассивВредныхФакторов = Неопределено Тогда
		Для Каждого ВредныйФактор Из ТекущиеДанные.МассивВредныхФакторов Цикл
			МассивВредныеФакторы.Добавить(ВредныйФактор);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РабочееМесто", ТекущиеДанные.РабочееМесто);
	ПараметрыОткрытия.Вставить("ВредныеФакторы", МассивВредныеФакторы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("УстановитьВредныеФакторыПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.Форма.ФормаВредныхФакторовРабочегоМеста",
		ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеРабочегоМеста()
	
	Описание = Новый Структура(
		"Подразделение,
		|Должность");
	
	Возврат Описание;
	
КонецФункции

&НаСервере
Функция АдресСпискаПодобранныхРабочихМест()
	
	МассивРабочихМест = Объект.РабочиеМеста.Выгрузить(, "РабочееМесто").ВыгрузитьКолонку("РабочееМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРабочихМест, Объект.АналогичныеМеста.Выгрузить(, "АналогичноеМесто").ВыгрузитьКолонку("АналогичноеМесто"), Истина);
	
	Возврат ПоместитьВоВременноеХранилище(МассивРабочихМест, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура РабочиеМестаОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ВыбранныеРабочиеМеста = ВыбранноеЗначение;
	Иначе
		ВыбранныеРабочиеМеста = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	ЕстьМодульМедицинскиеОсмотры = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда	
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		ЕстьМодульМедицинскиеОсмотры = Истина;
	КонецЕсли;
	
	Для каждого РабочееМесто Из ВыбранныеРабочиеМеста Цикл
		СтруктураПоискаРабочегоМеста = Новый Структура("РабочееМесто", РабочееМесто);
		СтруктураПоискаАналогичногоМеста = Новый Структура("АналогичноеМесто", РабочееМесто);
		Если Объект.РабочиеМеста.НайтиСтроки(СтруктураПоискаРабочегоМеста).Количество() = 0
			И Объект.АналогичныеМеста.НайтиСтроки(СтруктураПоискаАналогичногоМеста).Количество() = 0 Тогда
			
			НоваяСтрока = Объект.РабочиеМеста.Добавить();
			НоваяСтрока.РабочееМесто = РабочееМесто;
			НоваяСтрока.Подразделение = РабочееМесто.Подразделение;
			НоваяСтрока.Должность = РабочееМесто.Должность;
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			
			МассивВредныхФакторов = Новый Массив;
			Если ЕстьМодульМедицинскиеОсмотры Тогда	
				МассивВредныхФакторов = МодульМедицинскиеОсмотры.ВредныеФакторыИВидыРаботРабочегоМеста(НоваяСтрока.РабочееМесто);
			КонецЕсли;
			НоваяСтрока.МассивВредныхФакторов = Новый ФиксированныйМассив(МассивВредныхФакторов);
			ЗаполнитьКраткийСоставВредныхФакторов(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
